tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
void persistFeederCalibrationIfReady() {
  if (!g_at24cStoreReady) {
    return;
  }
  const Esp32At24cRecordStore::Result result =
      saveFeederCalibration(g_at24cStore, g_buckets.snapshot());
  if (!at24cWriteOk(result)) {
    ESP32BASE_LOG_W("farmfeeder", "calibration_save_failed result=%u",
                    static_cast<unsigned>(result));
  }
}

void initializeFeederAt24cStore() {
  const Esp32At24cRecordStore::Result beginResult =
      g_at24cStore.begin(g_at24cDevice,
                         kFeederAt24cConfig,
                         kFeederAt24cRegions,
                         kFeederAt24cRegionCount);
  if (beginResult != Esp32At24cRecordStore::Result::Ok) {
    ESP32BASE_LOG_W("farmfeeder", "at24c_store_begin_failed result=%u",
                    static_cast<unsigned>(beginResult));
    return;
  }
  g_at24cStoreReady = true;

  FeederScheduleSnapshot schedule;
  if (loadFeederSchedule(g_at24cStore, schedule) == Esp32At24cRecordStore::Result::Ok &&
      g_schedules.restore(schedule) == FeederScheduleResult::Ok) {
    g_lastScheduleDate = schedule.serviceDate;
  }

  FeederTodaySnapshot today;
  if (loadFeederToday(g_at24cStore, today) == Esp32At24cRecordStore::Result::Ok) {
    g_today.restore(today);
  }

  FeederTargetSnapshot targets;
  if (loadFeederTargets(g_at24cStore, targets) == Esp32At24cRecordStore::Result::Ok) {
    g_targets.restore(targets);
  }

  FeederBucketSnapshot calibration;
  FeederBucketSnapshot dynamicBuckets;
  const bool hasCalibration =
      loadFeederCalibration(g_at24cStore, calibration) == Esp32At24cRecordStore::Result::Ok;
  const bool hasDynamicBuckets =
      loadFeederBuckets(g_at24cStore, dynamicBuckets) == Esp32At24cRecordStore::Result::Ok;
  if (hasCalibration && hasDynamicBuckets) {
    restoreFeederBucketParts(g_buckets, calibration, dynamicBuckets);
  } else if (hasCalibration) {
    g_buckets.restore(calibration);
  }

  syncFeederConfigFromBaseInfo();
}

const char* deviceStateName(FeederDeviceState state) {
  switch (state) {
    case FeederDeviceState::Idle: return "Idle";
    case FeederDeviceState::Running: return "Running";
    case FeederDeviceState::Degraded: return "Degraded";
    case FeederDeviceState::Fault: return "Fault";
  }
  return "Unknown";
}

const char* channelStateName(FeederChannelState state) {
  switch (state) {
    case FeederChannelState::Disabled: return "Disabled";
    case FeederChannelState::Idle: return "Idle";
    case FeederChannelState::Running: return "Running";
    case FeederChannelState::Completed: return "Completed";
    case FeederChannelState::Fault: return "Fault";
  }
  return "Unknown";
}

const char* runSourceName(FeederRunSource source) {
  switch (source) {
    case FeederRunSource::Manual: return "Manual";
    case FeederRunSource::Schedule: return "Schedule";
  }
  return "Manual";
}

const char* recordTypeName(FeederRecordType type) {
  switch (type) {
    case FeederRecordType::ManualRequested: return "FeederManualRequested";
    case FeederRecordType::ScheduleTriggered: return "FeederScheduleTriggered";
    case FeederRecordType::ScheduleMissed: return "FeederScheduleMissed";
    case FeederRecordType::ChannelStarted: return "FeederChannelStarted";
    case FeederRecordType::ChannelStopped: return "FeederChannelStopped";
    case FeederRecordType::BatchCompleted: return "FeederBatchCompleted";
    case FeederRecordType::FaultCleared: return "FeederFaultCleared";
    case FeederRecordType::TodayCleared: return "FeederTodayCleared";
  }
  return "UnknownEvent";
}

bool recordTypeFromName(const char* name, FeederRecordType& out) {
  if (name == nullptr || name[0] == '\0') {
    return false;
  }
  if (strcmp(name, "FeederManualRequested") == 0 || strcmp(name, "ManualRequested") == 0) {
    out = FeederRecordType::ManualRequested;
    return true;
  }
  if (strcmp(name, "FeederScheduleTriggered") == 0 || strcmp(name, "ScheduleTriggered") == 0) {
    out = FeederRecordType::ScheduleTriggered;
    return true;
  }
  if (strcmp(name, "FeederScheduleMissed") == 0 || strcmp(name, "ScheduleMissed") == 0) {
    out = FeederRecordType::ScheduleMissed;
    return true;
  }
  if (strcmp(name, "FeederChannelStarted") == 0 || strcmp(name, "ChannelStarted") == 0) {
    out = FeederRecordType::ChannelStarted;
    return true;
  }
  if (strcmp(name, "FeederChannelStopped") == 0 || strcmp(name, "ChannelStopped") == 0) {
    out = FeederRecordType::ChannelStopped;
    return true;
  }
  if (strcmp(name, "FeederBatchCompleted") == 0 || strcmp(name, "BatchCompleted") == 0) {
    out = FeederRecordType::BatchCompleted;
    return true;
  }
  if (strcmp(name, "FeederFaultCleared") == 0 || strcmp(name, "FaultCleared") == 0) {
    out = FeederRecordType::FaultCleared;
    return true;
  }
  if (strcmp(name, "FeederTodayCleared") == 0 || strcmp(name, "TodayCleared") == 0) {
    out = FeederRecordType::TodayCleared;
    return true;
  }
  return false;
}

const char* recordResultName(FeederRecordResult result) {
  switch (result) {
    case FeederRecordResult::Ok: return "Ok";
    case FeederRecordResult::Partial: return "Partial";
    case FeederRecordResult::Busy: return "Busy";
    case FeederRecordResult::Fault: return "Fault";
    case FeederRecordResult::Skipped: return "Skipped";
    case FeederRecordResult::InvalidArgument: return "InvalidArgument";
  }
  return "InvalidArgument";
}

const char* targetModeFormValue(FeederTargetMode mode) {
  switch (mode) {
    case FeederTargetMode::Grams: return "grams";
    case FeederTargetMode::Revolutions: return "revolutions";
    case FeederTargetMode::None: return "none";
  }
  return "none";
}

void sendUint8(uint8_t value) {
  char number[8];
  snprintf(number, sizeof(number), "%u", static_cast<unsigned>(value));
  Esp32BaseWeb::sendChunk(number);
}

void sendInt32(int32_t value) {
  char number[16];
  snprintf(number, sizeof(number), "%ld", static_cast<long>(value));
  Esp32BaseWeb::sendChunk(number);
}

void sendFixedX100(int32_t value) {
  char number[24];
  const char* sign = value < 0 ? "-" : "";
  const int64_t absValue = value < 0 ? -static_cast<int64_t>(value) : static_cast<int64_t>(value);
  snprintf(number, sizeof(number), "%s%lld.%02lld",
           sign,
           static_cast<long long>(absValue / 100),
           static_cast<long long>(absValue % 100));
  Esp32BaseWeb::sendChunk(number);
}

void formatUint8(char* out, std::size_t outSize, uint8_t value) {
  if (out == nullptr || outSize == 0) {
    return;
  }
  snprintf(out, outSize, "%u", static_cast<unsigned>(value));
}

