tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
void sendPlanTargetInputs(const FeederPlanConfig& config, uint8_t channelIndex) {
  const FeederChannelTarget& target = config.targets[channelIndex];
  const unsigned channelNumber = static_cast<unsigned>(channelIndex + 1);
  Esp32BaseWeb::sendChunk("<fieldset><legend>通道");
  sendUint8(static_cast<uint8_t>(channelNumber));
  Esp32BaseWeb::sendChunk("</legend><label>目标模式 <select name='ch");
  sendUint8(channelIndex);
  Esp32BaseWeb::sendChunk("Mode'>");
  const FeederTargetMode modes[] = {
      FeederTargetMode::None,
      FeederTargetMode::Grams,
      FeederTargetMode::Revolutions,
  };
  const char* labels[] = {"不参与", "按克数", "按圈数"};
  for (uint8_t i = 0; i < 3; ++i) {
    Esp32BaseWeb::sendChunk("<option value='");
    Esp32BaseWeb::sendChunk(targetModeFormValue(modes[i]));
    Esp32BaseWeb::sendChunk("'");
    if (target.mode == modes[i]) {
      Esp32BaseWeb::sendChunk(" selected");
    }
    Esp32BaseWeb::sendChunk(">");
    Esp32BaseWeb::sendChunk(labels[i]);
    Esp32BaseWeb::sendChunk("</option>");
  }
  Esp32BaseWeb::sendChunk("</select></label><label>克数 <input name='ch");
  sendUint8(channelIndex);
  Esp32BaseWeb::sendChunk("Grams' value='");
  sendFixedX100(target.targetGramsX100);
  Esp32BaseWeb::sendChunk("'></label><label>圈数 <input name='ch");
  sendUint8(channelIndex);
  Esp32BaseWeb::sendChunk("Revolutions' value='");
  sendFixedX100(target.targetRevolutionsX100);
  Esp32BaseWeb::sendChunk("'></label></fieldset>");
}

void sendOccurrenceStatus(const FeederPlanState& plan,
                          uint32_t serviceDate,
                          uint32_t currentServiceDate) {
  if (!plan.config.enabled || !plan.config.timeConfigured) {
    Esp32BaseWeb::sendChunk("未启用");
    return;
  }
  if (plan.skipServiceDate == serviceDate) {
    Esp32BaseWeb::sendChunk("已跳过本次");
    return;
  }
  if (serviceDate == currentServiceDate) {
    if (plan.todayExecuted) {
      Esp32BaseWeb::sendChunk("已完成");
    } else if (plan.scheduleAttemptedToday) {
      Esp32BaseWeb::sendChunk("已尝试");
    } else if (plan.scheduleMissedToday) {
      Esp32BaseWeb::sendChunk("已错过");
    } else {
      Esp32BaseWeb::sendChunk("待执行");
    }
    return;
  }
  Esp32BaseWeb::sendChunk("将执行");
}

void sendOccurrenceAction(const FeederPlanState& plan, uint32_t serviceDate) {
  if (!plan.config.enabled || !plan.config.timeConfigured || serviceDate == 0) {
    Esp32BaseWeb::sendChunk("-");
    return;
  }
  const bool skipped = plan.skipServiceDate == serviceDate;
  Esp32BaseWeb::sendChunk("<form method='post' action='");
  Esp32BaseWeb::sendChunk(skipped ? "/api/app/schedule-occurrence/cancel-skip"
                                  : "/api/app/schedule-occurrence/skip");
  Esp32BaseWeb::sendChunk("'><input type='hidden' name='planId' value='");
  sendUint8(plan.config.planId);
  Esp32BaseWeb::sendChunk("'><input type='hidden' name='date' value='");
  sendUint32(serviceDate);
  Esp32BaseWeb::sendChunk("'><button class='btnlink compact");
  Esp32BaseWeb::sendChunk(skipped ? " info" : " warn");
  Esp32BaseWeb::sendChunk("'>");
  Esp32BaseWeb::sendChunk(skipped ? "取消跳过" : "跳过本次");
  Esp32BaseWeb::sendChunk("</button></form>");
}

void sendOccurrenceTable(const FeederScheduleSnapshot& schedules,
                         const FeederBucketSnapshot& buckets,
                         uint32_t serviceDate,
                         const char* title) {
  Esp32BaseWeb::beginPanel(title);
  if (serviceDate == 0) {
    Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                             "时间未同步",
                             "暂不能展示具体执行日期。");
    Esp32BaseWeb::endPanel();
    return;
  }
  Esp32BaseWeb::sendInfoRowCompact("服务日期", "本地业务日期", nullptr);
  Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><tr><th>时间</th><th>计划</th><th>状态</th><th>目标</th><th>操作</th></tr>");
  Esp32BaseWeb::sendChunk("<tr><td colspan='5'><span class='muted'>服务日期 ");
  sendUint32(serviceDate);
  Esp32BaseWeb::sendChunk("</span></td></tr>");
  for (uint8_t i = 0; i < schedules.planCount; ++i) {
    const FeederPlanState& plan = schedules.plans[i];
    Esp32BaseWeb::sendChunk("<tr><td>");
    sendPlanTime(plan.config.timeMinutes);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(plan.config.name);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendOccurrenceStatus(plan, serviceDate, schedules.serviceDate);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendPlanTargetSummary(plan.config, buckets);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendOccurrenceAction(plan, serviceDate);
    Esp32BaseWeb::sendChunk("</td></tr>");
  }
  Esp32BaseWeb::sendChunk("</table></div>");
  Esp32BaseWeb::endPanel();
}

void sendBucketSummary(const FeederBucketSnapshot& snapshot) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    const FeederBucketState& channel = snapshot.channels[i];
    Esp32BaseWeb::sendChunk("{\"channel\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"name\":\"");
    Esp32BaseWeb::writeJsonEscaped(channel.baseInfo.name);
    Esp32BaseWeb::sendChunk("\",\"enabled\":");
    Esp32BaseWeb::sendChunk(channel.baseInfo.enabled ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"outputPulsesPerRev\":");
    char number[16];
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.baseInfo.outputPulsesPerRev));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"gramsPerRevX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.baseInfo.gramsPerRevX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"capacityGramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.baseInfo.capacityGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"remainGramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.remainGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"remainPercent\":");
    sendUint8(channel.remainPercent);
    Esp32BaseWeb::sendChunk(",\"underflow\":");
    Esp32BaseWeb::sendChunk(channel.underflow ? "true" : "false");
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]");
}

