tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
void sendBucketAggregate(const FeederBucketSnapshot& snapshot) {
  uint8_t underflowMask = 0;
  uint8_t enabledMask = 0;
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const FeederBucketState& channel = snapshot.channels[i];
    if (channel.baseInfo.enabled) {
      enabledMask |= static_cast<uint8_t>(1U << i);
    }
    if (channel.underflow) {
      underflowMask |= static_cast<uint8_t>(1U << i);
    }
  }
  Esp32BaseWeb::sendChunk("{\"channelCount\":");
  sendUint8(kFeederConfiguredChannels);
  Esp32BaseWeb::sendChunk(",\"enabledMask\":");
  sendUint8(enabledMask);
  Esp32BaseWeb::sendChunk(",\"underflowMask\":");
  sendUint8(underflowMask);
  Esp32BaseWeb::sendChunk("}");
}

void sendTodaySummary(const FeederTodaySnapshot& snapshot) {
  Esp32BaseWeb::sendChunk("{\"serviceDate\":");
  sendUint32(snapshot.serviceDate);
  Esp32BaseWeb::sendChunk(",\"channels\":[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    const FeederTodayChannel& channel = snapshot.channels[i];
    Esp32BaseWeb::sendChunk("{\"channel\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"pulses\":");
    char number[16];
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.pulses));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"gramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.gramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]}");
}

void sendBaseInfoSummary(const FeederBucketSnapshot& snapshot) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    const FeederChannelBaseInfo& info = snapshot.channels[i].baseInfo;
    Esp32BaseWeb::sendChunk("{\"channel\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"name\":\"");
    Esp32BaseWeb::writeJsonEscaped(info.name);
    Esp32BaseWeb::sendChunk("\",\"enabled\":");
    Esp32BaseWeb::sendChunk(info.enabled ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"outputPulsesPerRev\":");
    char number[16];
    snprintf(number, sizeof(number), "%ld", static_cast<long>(info.outputPulsesPerRev));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"gramsPerRevX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(info.gramsPerRevX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"capacityGramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(info.capacityGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]");
}

const char* targetModeName(FeederTargetMode mode) {
  switch (mode) {
    case FeederTargetMode::None: return "None";
    case FeederTargetMode::Grams: return "Grams";
    case FeederTargetMode::Revolutions: return "Revolutions";
  }
  return "None";
}

const char* targetResultName(FeederTargetResult result) {
  switch (result) {
    case FeederTargetResult::Ok: return "Ok";
    case FeederTargetResult::InvalidArgument: return "InvalidArgument";
    case FeederTargetResult::NotCalibrated: return "NotCalibrated";
  }
  return "InvalidArgument";
}

void sendTargetSummary(const FeederTargetSnapshot& targets, const FeederBucketSnapshot& buckets) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    const FeederTargetRequest& target = targets.channels[i];
    const FeederChannelBaseInfo& info = buckets.channels[i].baseInfo;
    const FeederResolvedTarget resolved = resolveFeederTarget(info, target);
    Esp32BaseWeb::sendChunk("{\"channel\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"enabled\":");
    Esp32BaseWeb::sendChunk(info.enabled ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"targetMode\":\"");
    Esp32BaseWeb::sendChunk(targetModeName(target.mode));
    Esp32BaseWeb::sendChunk("\",\"targetGramsX100\":");
    char number[16];
    snprintf(number, sizeof(number), "%ld", static_cast<long>(target.targetGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"targetRevolutionsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(target.targetRevolutionsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"targetPulses\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(resolved.targetPulses));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"estimatedGramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(resolved.estimatedGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"calibrated\":");
    Esp32BaseWeb::sendChunk(info.gramsPerRevX100 > 0 ? "true" : "false");
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]");
}

void sendResolvedTargetArray(const FeederTargetBatch& batch) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    const FeederResolvedTarget& target = batch.channels[i];
    char number[16];
    Esp32BaseWeb::sendChunk("{\"channel\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"result\":\"");
    Esp32BaseWeb::sendChunk(targetResultName(target.result));
    Esp32BaseWeb::sendChunk("\",\"targetPulses\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(target.targetPulses));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"estimatedGramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(target.estimatedGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]");
}

void sendRecordJson(const FeederRecord& record) {
  char number[16];
  Esp32BaseWeb::sendChunk("{\"sequence\":");
  sendUint32(record.sequence);
  Esp32BaseWeb::sendChunk(",\"unixTime\":");
  sendUint32(record.unixTime);
  Esp32BaseWeb::sendChunk(",\"uptimeSec\":");
  sendUint32(record.uptimeSec);
  Esp32BaseWeb::sendChunk(",\"bootId\":");
  sendUint32(record.bootId);
  Esp32BaseWeb::sendChunk(",\"commandId\":");
  sendUint32(record.commandId);
  Esp32BaseWeb::sendChunk(",\"eventType\":\"");
  Esp32BaseWeb::sendChunk(recordTypeName(record.type));
  Esp32BaseWeb::sendChunk("\",\"result\":\"");
  Esp32BaseWeb::sendChunk(recordResultName(record.result));
  Esp32BaseWeb::sendChunk("\",\"planId\":");
  sendUint8(record.planId);
  Esp32BaseWeb::sendChunk(",\"channel\":");
  sendUint8(record.channel);
  Esp32BaseWeb::sendChunk(",\"requestedMask\":");
  sendUint8(record.requestedMask);
  Esp32BaseWeb::sendChunk(",\"successMask\":");
  sendUint8(record.successMask);
  Esp32BaseWeb::sendChunk(",\"busyMask\":");
  sendUint8(record.busyMask);
  Esp32BaseWeb::sendChunk(",\"faultMask\":");
  sendUint8(record.faultMask);
  Esp32BaseWeb::sendChunk(",\"skippedMask\":");
  sendUint8(record.skippedMask);
  Esp32BaseWeb::sendChunk(",\"targetPulses\":");
  snprintf(number, sizeof(number), "%ld", static_cast<long>(record.targetPulses));
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"estimatedGramsX100\":");
  snprintf(number, sizeof(number), "%ld", static_cast<long>(record.estimatedGramsX100));
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"actualPulses\":");
  snprintf(number, sizeof(number), "%ld", static_cast<long>(record.actualPulses));
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk("}");
}

void sendRecordArray(const FeederRecordSnapshot& snapshot) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < snapshot.count; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    sendRecordJson(snapshot.records[i]);
  }
  Esp32BaseWeb::sendChunk("]");
}

void sendRecordArray(const FeederRecordPage& page) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < page.count; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    sendRecordJson(page.records[i]);
  }
  Esp32BaseWeb::sendChunk("]");
}

const char* appEventLevelName(FarmAutoEventLog::Level level) {
  switch (level) {
    case FarmAutoEventLog::LEVEL_INFO: return "info";
    case FarmAutoEventLog::LEVEL_WARN: return "warn";
    case FarmAutoEventLog::LEVEL_ERROR: return "error";
  }
  return "info";
}

void sendBusinessEventJson(const FarmAutoEventLog::BusinessEvent& event) {
  Esp32BaseWeb::sendChunk("{\"id\":");
  sendUint32(event.id);
  Esp32BaseWeb::sendChunk(",\"epochSec\":");
  sendUint32(event.epochSec);
  Esp32BaseWeb::sendChunk(",\"bootId\":");
  sendUint32(event.bootId);
  Esp32BaseWeb::sendChunk(",\"uptimeSec\":");
  sendUint32(event.uptimeSec);
  Esp32BaseWeb::sendChunk(",\"timeSynced\":");
  Esp32BaseWeb::sendChunk(event.timeSynced ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"level\":\"");
  Esp32BaseWeb::sendChunk(appEventLevelName(event.level));
  Esp32BaseWeb::sendChunk("\",\"domain\":\"");
  Esp32BaseWeb::writeJsonEscaped(event.domain);
  Esp32BaseWeb::sendChunk("\",\"action\":\"");
  Esp32BaseWeb::writeJsonEscaped(event.action);
  Esp32BaseWeb::sendChunk("\",\"target\":\"");
  Esp32BaseWeb::writeJsonEscaped(event.target);
  Esp32BaseWeb::sendChunk("\",\"message\":\"");
  Esp32BaseWeb::writeJsonEscaped(event.message);
  Esp32BaseWeb::sendChunk("\",\"detail\":\"");
  Esp32BaseWeb::writeJsonEscaped(event.detail);
  Esp32BaseWeb::sendChunk("\",\"code\":");
  sendUint32(event.code);
  Esp32BaseWeb::sendChunk(",\"valueMask\":");
  sendUint32(event.valueMask);
  Esp32BaseWeb::sendChunk(",\"value1\":");
  sendInt32(event.value1);
  Esp32BaseWeb::sendChunk(",\"value2\":");
  sendInt32(event.value2);
  Esp32BaseWeb::sendChunk(",\"value3\":");
  sendInt32(event.value3);
  Esp32BaseWeb::sendChunk("}");
}

struct BusinessEventJsonState {
  uint16_t emitted = 0;
};

void sendBusinessEventJsonCallback(const FarmAutoEventLog::BusinessEvent& event, void* user) {
  BusinessEventJsonState* state = static_cast<BusinessEventJsonState*>(user);
  if (state == nullptr) {
    return;
  }
  if (state->emitted > 0) {
    Esp32BaseWeb::sendChunk(",");
  }
  sendBusinessEventJson(event);
  ++state->emitted;
}

