tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
void sendRecentCommandJson() {
  const FeederRecordSnapshot records = g_records.snapshot();
  for (uint8_t i = records.count; i > 0; --i) {
    const FeederRecord& record = records.records[i - 1];
    if (record.commandId == 0) {
      continue;
    }
    Esp32BaseWeb::sendChunk("{\"commandId\":");
    sendUint32(record.commandId);
    Esp32BaseWeb::sendChunk(",\"sequence\":");
    sendUint32(record.sequence);
    Esp32BaseWeb::sendChunk(",\"unixTime\":");
    sendUint32(record.unixTime);
    Esp32BaseWeb::sendChunk(",\"eventType\":\"");
    Esp32BaseWeb::sendChunk(recordTypeName(record.type));
    Esp32BaseWeb::sendChunk("\",\"result\":\"");
    Esp32BaseWeb::sendChunk(recordResultName(record.result));
    Esp32BaseWeb::sendChunk("\",\"planId\":");
    sendUint8(record.planId);
    Esp32BaseWeb::sendChunk(",\"channel\":");
    sendUint8(record.channel);
    Esp32BaseWeb::sendChunk(",\"requestedMask\":");
    sendUint8(record.requestedMask);
    Esp32BaseWeb::sendChunk(",\"successMask\":");
    sendUint8(record.successMask);
    Esp32BaseWeb::sendChunk(",\"skippedMask\":");
    sendUint8(record.skippedMask);
    Esp32BaseWeb::sendChunk("}");
    return;
  }
  Esp32BaseWeb::sendChunk("null");
}

bool readUint8Param(const char* name, uint8_t& out) {
  char raw[12];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return false;
  }
  char* end = nullptr;
  const unsigned long value = strtoul(raw, &end, 10);
  if (!end || *end != '\0' || value > 255) {
    return false;
  }
  out = static_cast<uint8_t>(value);
  return true;
}

bool readUint32Param(const char* name, uint32_t& out) {
  char raw[16];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return false;
  }
  char* end = nullptr;
  const unsigned long value = strtoul(raw, &end, 10);
  if (!end || *end != '\0') {
    return false;
  }
  out = static_cast<uint32_t>(value);
  return true;
}

bool readUint32ParamOptional(const char* name, uint32_t& out) {
  return !Esp32BaseWeb::hasParam(name) || readUint32Param(name, out);
}

bool readInt32Param(const char* name, int32_t& out) {
  char raw[16];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return false;
  }
  char* end = nullptr;
  const long value = strtol(raw, &end, 10);
  if (!end || *end != '\0') {
    return false;
  }
  out = static_cast<int32_t>(value);
  return true;
}

bool readInt32ParamOptional(const char* name, int32_t& out) {
  return !Esp32BaseWeb::hasParam(name) || readInt32Param(name, out);
}

bool readFixedX100Param(const char* name, int32_t& out) {
  char raw[20];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return false;
  }
  char* end = nullptr;
  const double value = strtod(raw, &end);
  if (!end || *end != '\0') {
    return false;
  }
  out = static_cast<int32_t>(value * 100.0 + (value >= 0 ? 0.5 : -0.5));
  return true;
}

bool readFixedX100ParamOptional(const char* decimalName,
                                const char* legacyName,
                                int32_t& out) {
  if (Esp32BaseWeb::hasParam(decimalName)) {
    return readFixedX100Param(decimalName, out);
  }
  return !Esp32BaseWeb::hasParam(legacyName) || readInt32Param(legacyName, out);
}

bool readBoolParam(const char* name, bool& out) {
  char raw[8];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return false;
  }
  if (strcmp(raw, "true") == 0 || strcmp(raw, "1") == 0) {
    out = true;
    return true;
  }
  if (strcmp(raw, "false") == 0 || strcmp(raw, "0") == 0) {
    out = false;
    return true;
  }
  return false;
}

void readPlanNameParam(FeederPlanConfig& config) {
  char raw[kFeederPlanNameMaxBytes + 1] = {};
  if (Esp32BaseWeb::getParam("name", raw, sizeof(raw))) {
    strlcpy(config.name, raw, sizeof(config.name));
  }
}

void readChannelNameParam(FeederChannelBaseInfo& info) {
  char raw[kFeederChannelNameMaxBytes + 1] = {};
  if (Esp32BaseWeb::getParam("name", raw, sizeof(raw))) {
    strlcpy(info.name, raw, sizeof(info.name));
  }
}

bool parseTargetModeText(const char* raw, FeederTargetMode& out) {
  if (strcmp(raw, "grams") == 0 || strcmp(raw, "Grams") == 0) {
    out = FeederTargetMode::Grams;
    return true;
  }
  if (strcmp(raw, "revolutions") == 0 || strcmp(raw, "Revolutions") == 0) {
    out = FeederTargetMode::Revolutions;
    return true;
  }
  if (strcmp(raw, "none") == 0 || strcmp(raw, "None") == 0) {
    out = FeederTargetMode::None;
    return true;
  }
  return false;
}

bool readTargetModeParam(const char* name, FeederTargetMode& out) {
  char raw[16];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    out = FeederTargetMode::None;
    return true;
  }
  return parseTargetModeText(raw, out);
}

const char* bucketResultName(FeederBucketResult result) {
  switch (result) {
    case FeederBucketResult::Ok: return "Ok";
    case FeederBucketResult::InvalidArgument: return "InvalidArgument";
    case FeederBucketResult::Underflow: return "Underflow";
  }
  return "InvalidArgument";
}

void sendResultJson(int code, const char* result, uint32_t commandId = 0) {
  beginRawJson(code);
  Esp32BaseWeb::sendChunk("{\"result\":\"");
  Esp32BaseWeb::sendChunk(result);
  Esp32BaseWeb::sendChunk("\",\"commandId\":");
  sendUint32(commandId);
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
}

void sendConfirmRequired(const char* action, const char* resource) {
  char token[9] = {};
  if (!g_confirm.issue(action, resource, millis(), esp_random(), token, sizeof(token))) {
    sendResultJson(500, "InvalidArgument");
    return;
  }
  beginRawJson(409);
  Esp32BaseWeb::sendChunk("{\"result\":\"ConfirmRequired\",\"actionId\":\"");
  Esp32BaseWeb::sendChunk(action);
  Esp32BaseWeb::sendChunk("\",\"resource\":\"");
  Esp32BaseWeb::sendChunk(resource);
  Esp32BaseWeb::sendChunk("\",\"confirmToken\":\"");
  Esp32BaseWeb::sendChunk(token);
  Esp32BaseWeb::sendChunk("\",\"ttlMs\":60000}");
  endRawJson();
}

bool confirmAccepted() {
  bool confirm = false;
  return readBoolParam("confirm", confirm) && confirm;
}

