tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
bool requireConfirm(const char* action, const char* resource) {
  char token[16] = {};
  if (confirmAccepted() &&
      Esp32BaseWeb::getParam("confirmToken", token, sizeof(token)) &&
      g_confirm.consume(action, resource, token, millis())) {
    return true;
  }
  sendConfirmRequired(action, resource);
  return false;
}

bool feederMotorReady(uint8_t channelIndex) {
  return channelIndex < kFeederConfiguredChannels &&
         (g_feederMotorReadyMask & static_cast<uint8_t>(1U << channelIndex)) != 0;
}

bool configureFeederMotorIfEnabled(uint8_t channelIndex, int32_t maxRunPulses = 0) {
  if (!g_feederMotorOutputEnabled || !validAppChannel(channelIndex)) {
    return false;
  }
  const uint8_t bit = static_cast<uint8_t>(1U << channelIndex);
  if ((g_feederMotorReadyMask & bit) == 0) {
    Esp32EncodedDcMotor::MotorResult result =
        g_feederMotorEncoder[channelIndex].begin(g_feederEncoderBackend[channelIndex]);
    if (result != Esp32EncodedDcMotor::MotorResult::Ok) {
      ESP32BASE_LOG_E("farmfeeder", "encoder_begin_failed channel=%u result=%u",
                      static_cast<unsigned>(channelIndex), static_cast<unsigned>(result));
      FarmAutoEventLog::recordStorageWarning("feeder_motor", "encoder_begin_failed",
                                             static_cast<uint16_t>(result));
      return false;
    }
    result = g_feederMotorDriver[channelIndex].begin(kFeederPwmPins[channelIndex],
                                                     g_feederMotorHardware[channelIndex]);
    if (result != Esp32EncodedDcMotor::MotorResult::Ok) {
      ESP32BASE_LOG_E("farmfeeder", "driver_begin_failed channel=%u result=%u",
                      static_cast<unsigned>(channelIndex), static_cast<unsigned>(result));
      FarmAutoEventLog::recordStorageWarning("feeder_motor", "driver_begin_failed",
                                             static_cast<uint16_t>(result));
      return false;
    }
    result = g_feederMotor[channelIndex].begin(g_feederMotorDriver[channelIndex],
                                               g_feederMotorEncoder[channelIndex],
                                               g_feederMotorHardware[channelIndex],
                                               g_feederEncoderBackend[channelIndex]);
    if (result != Esp32EncodedDcMotor::MotorResult::Ok) {
      ESP32BASE_LOG_E("farmfeeder", "motor_begin_failed channel=%u result=%u",
                      static_cast<unsigned>(channelIndex), static_cast<unsigned>(result));
      FarmAutoEventLog::recordStorageWarning("feeder_motor", "motor_begin_failed",
                                             static_cast<uint16_t>(result));
      return false;
    }
    g_feederMotorReadyMask |= bit;
  }
  if (maxRunPulses > 0) {
    g_feederMotorProtection[channelIndex].maxRunPulses = maxRunPulses;
  }
  const Esp32EncodedDcMotor::MotorResult configureResult =
      g_feederMotor[channelIndex].configure(g_feederMotorKinematics[channelIndex],
                                            g_feederMotorProfile[channelIndex],
                                            g_feederMotorProtection[channelIndex],
                                            g_feederMotorStopPolicy[channelIndex]);
  return configureResult == Esp32EncodedDcMotor::MotorResult::Ok;
}

bool startFeederMotor(uint8_t channelIndex, int32_t targetPulses) {
  if (targetPulses <= 0) {
    return false;
  }
  const int32_t maxRunPulses = targetPulses + (targetPulses / 2) + 100;
  if (!configureFeederMotorIfEnabled(channelIndex, maxRunPulses)) {
    return false;
  }
  g_feederMotorEncoder[channelIndex].resetPosition(0);
  g_feederMotor[channelIndex].setCurrentPositionPulses(0);
  return g_feederMotor[channelIndex].requestMovePulses(targetPulses) ==
         Esp32EncodedDcMotor::MotorResult::Ok;
}

void requestFeederMotorStop(uint8_t channelMask) {
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const uint8_t bit = static_cast<uint8_t>(1U << i);
    if ((channelMask & bit) != 0 && feederMotorReady(i)) {
      g_feederMotor[i].requestStop();
      g_runs.updateActualPulses(i, static_cast<int32_t>(g_feederMotor[i].snapshot().positionPulses));
    }
  }
}

void sendFeederMotorOutputJson() {
  Esp32BaseWeb::sendChunk("\"motorOutput\":{\"enabled\":");
  Esp32BaseWeb::sendChunk(g_feederMotorOutputEnabled ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"readyMask\":");
  sendUint8(g_feederMotorReadyMask);
  Esp32BaseWeb::sendChunk(",\"channels\":[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    Esp32BaseWeb::sendChunk("{\"index\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"ready\":");
    Esp32BaseWeb::sendChunk(feederMotorReady(i) ? "true" : "false");
    if (feederMotorReady(i)) {
      const Esp32EncodedDcMotor::MotorSnapshot motor = g_feederMotor[i].snapshot();
      Esp32BaseWeb::sendChunk(",\"positionPulses\":");
      sendInt32(static_cast<int32_t>(motor.positionPulses));
      Esp32BaseWeb::sendChunk(",\"targetPulses\":");
      sendInt32(static_cast<int32_t>(motor.targetPulses));
      Esp32BaseWeb::sendChunk(",\"outputPercent\":");
      sendUint8(motor.driverOutputPercent);
      Esp32BaseWeb::sendChunk(",\"faultReason\":");
      sendUint8(static_cast<uint8_t>(motor.faultReason));
    }
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]}");
}

void settleStoppedRuns(uint8_t channelMask) {
  bool changed = false;
  const FeederRunSnapshot runs = g_runs.snapshot();
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const uint8_t bit = static_cast<uint8_t>(1U << i);
    if ((channelMask & bit) == 0 || !runs.channels[i].active) {
      continue;
    }
    FeederRunChannel completed;
    if (!g_runs.finish(i, runs.channels[i].actualPulses, completed)) {
      continue;
    }
    FeederFeedSettlement settlement;
    const FeederFeedSettlementResult result =
        settleCompletedFeederRun(i, completed, g_today, g_buckets, settlement);
    if (result == FeederFeedSettlementResult::Ok ||
        result == FeederFeedSettlementResult::Underflow) {
      changed = true;
    }
  }
  if (changed) {
    persistFeederTodayIfReady();
    persistFeederBucketsIfReady();
  }
}

