tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
void updateFeederMotors() {
  if (g_feederMotorReadyMask == 0) {
    return;
  }
  uint8_t completedMask = 0;
  uint8_t faultMask = 0;
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const uint8_t bit = static_cast<uint8_t>(1U << i);
    if ((g_feeder.snapshot().runningChannelMask & bit) == 0 || !feederMotorReady(i)) {
      continue;
    }
    g_feederMotor[i].update(millis());
    const Esp32EncodedDcMotor::MotorSnapshot motor = g_feederMotor[i].snapshot();
    g_runs.updateActualPulses(i, static_cast<int32_t>(motor.positionPulses));
    if (motor.state == Esp32EncodedDcMotor::MotorState::Idle) {
      if (g_feeder.completeChannel(i) == FeederCommandResult::Ok) {
        completedMask |= bit;
      }
    } else if (motor.state == Esp32EncodedDcMotor::MotorState::Fault) {
      g_feeder.setChannelFault(i);
      faultMask |= bit;
    }
  }
  if (completedMask != 0) {
    settleStoppedRuns(completedMask);
  }
  if (faultMask != 0) {
    FarmAutoEventLog::recordStorageWarning("feeder_motor", "motor_fault", faultMask);
  }
}

const char* scheduleResultName(FeederScheduleResult result) {
  switch (result) {
    case FeederScheduleResult::Ok: return "Ok";
    case FeederScheduleResult::Full: return "Full";
    case FeederScheduleResult::NotFound: return "NotFound";
    case FeederScheduleResult::InvalidArgument: return "InvalidArgument";
  }
  return "InvalidArgument";
}

const char* feederCommandResultName(FeederCommandResult result) {
  switch (result) {
    case FeederCommandResult::Ok: return "Ok";
    case FeederCommandResult::Partial: return "Partial";
    case FeederCommandResult::Busy: return "Busy";
    case FeederCommandResult::NotConfigured: return "NotConfigured";
    case FeederCommandResult::Fault: return "Fault";
    case FeederCommandResult::InvalidArgument: return "InvalidArgument";
  }
  return "InvalidArgument";
}

void sendStartResultJson(const FeederStartResult& result,
                         const FeederTargetBatch* targets = nullptr,
                         uint32_t commandId = 0) {
  const bool success = result.result == FeederCommandResult::Ok ||
                       result.result == FeederCommandResult::Partial;
  beginRawJson(success ? 200 : 400);
  Esp32BaseWeb::sendChunk("{\"result\":\"");
  Esp32BaseWeb::sendChunk(feederCommandResultName(result.result));
  Esp32BaseWeb::sendChunk("\",\"commandId\":");
  sendUint32(commandId);
  Esp32BaseWeb::sendChunk(",\"successMask\":");
  sendUint8(result.successMask);
  Esp32BaseWeb::sendChunk(",\"busyMask\":");
  sendUint8(result.busyMask);
  Esp32BaseWeb::sendChunk(",\"faultMask\":");
  sendUint8(result.faultMask);
  Esp32BaseWeb::sendChunk(",\"skippedMask\":");
  sendUint8(result.skippedMask);
  if (targets) {
    Esp32BaseWeb::sendChunk(",\"targetOkMask\":");
    sendUint8(targets->okMask);
    Esp32BaseWeb::sendChunk(",\"targetInvalidMask\":");
    sendUint8(targets->invalidMask);
    Esp32BaseWeb::sendChunk(",\"targetNotCalibratedMask\":");
    sendUint8(targets->notCalibratedMask);
    Esp32BaseWeb::sendChunk(",\"targets\":");
    sendResolvedTargetArray(*targets);
  }
  Esp32BaseWeb::sendChunk(",");
  sendFeederMotorOutputJson();
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
}

FeederStartResult startResolvedTargets(uint8_t channelMask,
                                       FeederRunSource source,
                                       uint32_t commandId,
                                       FeederTargetBatch& targets,
                                       const FeederTargetSnapshot* targetOverrides = nullptr) {
  if (!g_feederMotorOutputEnabled) {
    FeederStartResult result;
    result.result = FeederCommandResult::InvalidArgument;
    result.skippedMask = channelMask;
    return result;
  }
  const FeederTargetSnapshot storedTargets = g_targets.snapshot();
  targets = resolveFeederTargetsForMask(g_buckets.snapshot(),
                                        targetOverrides ? *targetOverrides : storedTargets,
                                        channelMask);
  if (targets.okMask == 0) {
    FeederStartResult result;
    result.result = FeederCommandResult::InvalidArgument;
    result.skippedMask = channelMask;
    return result;
  }
  FeederStartResult result = g_feeder.startChannels(targets.okMask, source);
  if (result.successMask != 0) {
    uint8_t motorStartedMask = 0;
    uint8_t motorFailedMask = 0;
    for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
      const uint8_t bit = static_cast<uint8_t>(1U << i);
      if ((result.successMask & bit) == 0) {
        continue;
      }
      if (startFeederMotor(i, targets.channels[i].targetPulses)) {
        motorStartedMask |= bit;
      } else {
        motorFailedMask |= bit;
        g_feeder.setChannelFault(i);
      }
    }
    result.successMask = motorStartedMask;
    result.faultMask |= motorFailedMask;
    if (result.successMask == 0) {
      result.result = result.faultMask != 0 ? FeederCommandResult::Fault
                                            : FeederCommandResult::InvalidArgument;
      return result;
    }
    g_runs.start(result.successMask, source, targets);
    for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
      const uint8_t bit = static_cast<uint8_t>(1U << i);
      if ((result.successMask & bit) == 0) {
        continue;
      }
      FeederRecord record;
      record.commandId = commandId;
      record.type = FeederRecordType::ChannelStarted;
      record.result = FeederRecordResult::Ok;
      record.channel = i;
      record.successMask = bit;
      record.targetPulses = targets.channels[i].targetPulses;
      record.estimatedGramsX100 = targets.channels[i].estimatedGramsX100;
      recordBusinessEvent(record);
    }
  }
  result.skippedMask |= static_cast<uint8_t>(targets.invalidMask | targets.notCalibratedMask);
  if (result.successMask != 0 && result.skippedMask != 0 && result.result == FeederCommandResult::Ok) {
    result.result = FeederCommandResult::Partial;
  }
  return result;
}

bool readManualTargetOverrides(uint8_t channelMask, FeederTargetSnapshot& out) {
  out = g_targets.snapshot();
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const uint8_t bit = static_cast<uint8_t>(1U << i);
    if ((channelMask & bit) == 0) {
      continue;
    }
    char name[32];
    char rawMode[20];
    snprintf(name, sizeof(name), "ch%uMode", static_cast<unsigned>(i + 1));
    if (!Esp32BaseWeb::getParam(name, rawMode, sizeof(rawMode)) || rawMode[0] == '\0') {
      continue;
    }
    FeederTargetMode mode = FeederTargetMode::None;
    if (!parseTargetModeText(rawMode, mode) || mode == FeederTargetMode::None) {
      return false;
    }

