tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
    FeederTargetRequest request;
    request.mode = mode;
    snprintf(name, sizeof(name), "ch%uGramsX100", static_cast<unsigned>(i + 1));
    char decimalName[32];
    snprintf(decimalName, sizeof(decimalName), "ch%uGrams", static_cast<unsigned>(i + 1));
    if (!readFixedX100ParamOptional(decimalName, name, request.targetGramsX100)) {
      return false;
    }
    snprintf(name, sizeof(name), "ch%uRevolutionsX100", static_cast<unsigned>(i + 1));
    snprintf(decimalName, sizeof(decimalName), "ch%uRevolutions", static_cast<unsigned>(i + 1));
    if (!readFixedX100ParamOptional(decimalName, name, request.targetRevolutionsX100)) {
      return false;
    }
    if (mode == FeederTargetMode::Grams && request.targetGramsX100 <= 0) {
      return false;
    }
    if (mode == FeederTargetMode::Revolutions && request.targetRevolutionsX100 <= 0) {
      return false;
    }
    out.channels[i] = request;
  }
  return true;
}

bool readManualChannelMask(uint8_t& out) {
  if (Esp32BaseWeb::hasParam("channelMask")) {
    return readUint8Param("channelMask", out);
  }
  uint8_t mask = 0;
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    char name[20];
    bool selected = false;
    snprintf(name, sizeof(name), "ch%uEnabled", static_cast<unsigned>(i + 1));
    if (readBoolParam(name, selected) && selected) {
      mask |= static_cast<uint8_t>(1U << i);
    }
  }
  out = mask;
  return true;
}

FeederTargetSnapshot targetSnapshotFromPlan(const FeederPlanConfig& plan) {
  FeederTargetSnapshot targets;
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    targets.channels[i].mode = plan.targets[i].mode;
    targets.channels[i].targetGramsX100 = plan.targets[i].targetGramsX100;
    targets.channels[i].targetRevolutionsX100 = plan.targets[i].targetRevolutionsX100;
  }
  return targets;
}

bool findPlanConfig(uint8_t planId, FeederPlanConfig& out) {
  const FeederScheduleSnapshot snapshot = g_schedules.snapshot();
  for (uint8_t i = 0; i < snapshot.planCount; ++i) {
    if (snapshot.plans[i].config.planId == planId) {
      out = snapshot.plans[i].config;
      return true;
    }
  }
  return false;
}

FeederStartResult startPlanTargets(const FeederPlanConfig& plan, FeederTargetBatch& targets) {
  targets = resolveFeederTargetsForMask(g_buckets.snapshot(), targetSnapshotFromPlan(plan), plan.channelMask);
  FeederStartResult result;
  if (targets.okMask != 0) {
    result = g_feeder.startChannels(targets.okMask, FeederRunSource::Schedule);
    if (result.successMask != 0) {
      g_runs.start(result.successMask, FeederRunSource::Schedule, targets);
    }
  } else {
    result.result = FeederCommandResult::InvalidArgument;
  }
  result.skippedMask |= static_cast<uint8_t>(
      plan.channelMask & static_cast<uint8_t>(targets.invalidMask | targets.notCalibratedMask));
  if (result.successMask != 0 && result.skippedMask != 0 && result.result == FeederCommandResult::Ok) {
    result.result = FeederCommandResult::Partial;
  }
  return result;
}

bool readPlanConfigFromParams(FeederPlanConfig& config) {
  int32_t raw = 0;
  if (!readBoolParam("enabled", config.enabled)) {
    return false;
  }
  readPlanNameParam(config);
  config.timeConfigured = Esp32BaseWeb::hasParam("timeMinutes");
  if (config.timeConfigured) {
    if (!readInt32Param("timeMinutes", raw) || raw < 0 || raw >= 24 * 60) {
      return false;
    }
    config.timeMinutes = static_cast<uint16_t>(raw);
  }
  if (Esp32BaseWeb::hasParam("channelMask")) {
    if (!readInt32Param("channelMask", raw) || raw < 0 || raw > 15) {
      return false;
    }
    config.channelMask = static_cast<uint8_t>(raw);
  }

  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    char name[28];
    snprintf(name, sizeof(name), "ch%uMode", static_cast<unsigned>(i));
    if (!readTargetModeParam(name, config.targets[i].mode)) {
      return false;
    }
    snprintf(name, sizeof(name), "ch%uGramsX100", static_cast<unsigned>(i));
    if (!readInt32ParamOptional(name, config.targets[i].targetGramsX100)) {
      return false;
    }
    snprintf(name, sizeof(name), "ch%uRevolutionsX100", static_cast<unsigned>(i));
    if (!readInt32ParamOptional(name, config.targets[i].targetRevolutionsX100)) {
      return false;
    }
  }
  return true;
}

}  // namespace

FarmFeederApp FarmFeeder;

void FarmFeederApp::begin() {
  Serial.begin(115200);
  Wire.begin(kFeederI2cSda, kFeederI2cScl);
  configureStaticDefaults();

  Esp32Base::setFirmwareInfo("Esp32FarmFeeder", "0.1.0");
  configureAppConfigPage();
  configureBusinessShell();

  if (!Esp32Base::begin()) {
    ESP32BASE_LOG_E("farmfeeder", "Esp32Base begin failed: %s", Esp32Base::lastError());
  } else {
    initializeFeederAt24cStore();
    g_feederMotorOutputEnabled = Esp32BaseConfig::getBool("feeder", "motorOutput", false);
    ESP32BASE_LOG_I("farmfeeder", "skeleton ready enabled_mask=%u", g_feederConfig.enabledChannelMask);
  }
}

void FarmFeederApp::handle() {
  Esp32Base::handle();
  updateFeederMotors();
  handleScheduleTick();
}

void FarmFeederApp::handleScheduleTick() {
#if ESP32BASE_ENABLE_NTP
  const Esp32BaseNtp::TimeSnapshot timeSnapshot = Esp32BaseNtp::snapshot();
  if (!timeSnapshot.synced || timeSnapshot.epochSec == 0) {
    return;
  }

  uint32_t serviceDate = 0;
  uint16_t currentMinute = 0;
  if (!feederLocalDateAndMinute(timeSnapshot.epochSec, serviceDate, currentMinute)) {
    return;
  }

  if (serviceDate != g_lastScheduleDate) {
    g_schedules.beginDay(serviceDate);
    g_today.beginDay(serviceDate);
    g_lastScheduleDate = serviceDate;
    g_lastScheduleMinute = 24 * 60;
    persistFeederScheduleIfReady();
    persistFeederTodayIfReady();
  }
  if (currentMinute == g_lastScheduleMinute) {
    return;
  }
  g_lastScheduleMinute = currentMinute;

  const FeederScheduleTick tick = g_schedules.evaluate(currentMinute, true);
  if (tick.action == FeederScheduleAction::NoAction) {
    return;
  }
  if (tick.action == FeederScheduleAction::MarkMissed) {
    FeederRecord record;
    record.type = FeederRecordType::ScheduleMissed;
    record.result = FeederRecordResult::Skipped;
    record.planId = tick.planId;
    recordBusinessEvent(record);
    ESP32BASE_LOG_W("farmfeeder", "schedule_missed plan_id=%u date=%lu minute=%u",
                    static_cast<unsigned>(tick.planId),
                    static_cast<unsigned long>(serviceDate),
                    static_cast<unsigned>(currentMinute));
    persistFeederScheduleIfReady();
    return;
  }

  FeederPlanConfig plan;
  if (!findPlanConfig(tick.planId, plan)) {
    ESP32BASE_LOG_W("farmfeeder", "schedule_plan_missing plan_id=%u",
                    static_cast<unsigned>(tick.planId));
    return;
  }

  g_schedules.markAttempted(tick.planId);
  FeederTargetBatch targets;
  const uint32_t commandId = allocateCommandId();
  const FeederStartResult result = startPlanTargets(plan, targets);
  FeederRecord record;
  record.commandId = commandId;
  record.type = FeederRecordType::ScheduleTriggered;
  record.result = feederRecordResultFromCommand(result.result);
  record.planId = tick.planId;
  record.requestedMask = plan.channelMask;
  record.successMask = result.successMask;
  record.busyMask = result.busyMask;
  record.faultMask = result.faultMask;
  record.skippedMask = result.skippedMask;
  recordBusinessEvent(record);
  persistFeederScheduleIfReady();
  ESP32BASE_LOG_I("farmfeeder",
                  "schedule_triggered plan_id=%u result=%u success_mask=%u skipped_mask=%u",
                  static_cast<unsigned>(tick.planId),
                  static_cast<unsigned>(result.result),
                  static_cast<unsigned>(result.successMask),
                  static_cast<unsigned>(result.skippedMask));
#endif
}

void FarmFeederApp::configureStaticDefaults() {
  g_feederConfig.installedChannelMask = configuredChannelMask();
  g_feederConfig.enabledChannelMask = configuredChannelMask();

  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    g_feederMotorHardware[i].driverType = Esp32EncodedDcMotor::DriverType::SinglePwm;
    g_feederMotorHardware[i].pwmFrequencyHz = 20000;
    g_feederMotorHardware[i].pwmResolutionBits = 8;
    g_feederMotorHardware[i].ledcChannelA = i;

