tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
    g_feederEncoderBackend[i].backendType = Esp32EncodedDcMotor::EncoderBackendType::Pcnt;
    g_feederEncoderBackend[i].pinA = kFeederEncoderPinsA[i];
    g_feederEncoderBackend[i].pinB = kFeederEncoderPinsB[i];
    g_feederEncoderBackend[i].countMode = Esp32EncodedDcMotor::CountMode::X1;
    g_feederEncoderBackend[i].pcntUnit = i;
    g_feederEncoderBackend[i].glitchFilterNs = 1000;

    g_feederMotorKinematics[i].motorShaftPulsesPerRev = 16;
    g_feederMotorKinematics[i].outputPulsesPerRev = 4320;
    g_feederMotorKinematics[i].countMode = Esp32EncodedDcMotor::CountMode::X1;

    g_feederMotorProfile[i].speedPercent = 60;
    g_feederMotorProfile[i].softStartMs = 500;
    g_feederMotorProfile[i].softStopMs = 300;
    g_feederMotorProfile[i].minEffectiveSpeedPercent = 15;

    g_feederMotorProtection[i].startupGraceMs = 1000;
    g_feederMotorProtection[i].stallCheckIntervalMs = 250;
    g_feederMotorProtection[i].minPulseDelta = 1;
    g_feederMotorProtection[i].maxRunMs = 30000;
    g_feederMotorStopPolicy[i].emergencyOutputMode =
        Esp32EncodedDcMotor::EmergencyOutputMode::Coast;
  }

  g_schedules.beginDay(0);
  g_today.beginDay(0);

  FeederChannelBaseInfo channelInfo;
  channelInfo.enabled = true;
  channelInfo.outputPulsesPerRev = 4320;
  channelInfo.gramsPerRevX100 = 7000;
  channelInfo.capacityGramsX100 = 500000;
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    snprintf(channelInfo.name, sizeof(channelInfo.name), "通道 %u", static_cast<unsigned>(i + 1));
    if (g_buckets.updateBaseInfo(i, channelInfo) != FeederBucketResult::Ok) {
      ESP32BASE_LOG_E("farmfeeder", "bucket_base_info_failed channel=%u", static_cast<unsigned>(i));
    }
    FeederTargetRequest target;
    target.mode = FeederTargetMode::Grams;
    target.targetGramsX100 = 7000;
    if (g_targets.setTarget(i, target) != FeederTargetResult::Ok) {
      ESP32BASE_LOG_E("farmfeeder", "target_default_failed channel=%u", static_cast<unsigned>(i));
    }
  }
  syncFeederConfigFromBaseInfo();
}

void FarmFeederApp::configureAppConfigPage() {
#if ESP32BASE_ENABLE_APP_CONFIG
  Esp32BaseAppConfig::setTitle("Esp32FarmFeeder 参数");
  Esp32BaseAppConfig::addGroup({"motor", "电机"});
  Esp32BaseAppConfig::addBool({"motor", "feeder", "motorOutput", "启用电机输出", false,
                               "启用后三路喂食命令会输出 PWM。", true, nullptr});
#endif
}

void FarmFeederApp::configureBusinessShell() {
#if ESP32BASE_ENABLE_WEB
  Esp32BaseWeb::setDeviceName("Esp32FarmFeeder");
  Esp32BaseWeb::setHomePath("/index");
  Esp32BaseWeb::setHomeMode(Esp32BaseWeb::HOME_APP);
  Esp32BaseWeb::setSystemNavMode(Esp32BaseWeb::SYSTEM_NAV_SECTION);
  Esp32BaseWeb::addNavItem("/index", "首页");
  Esp32BaseWeb::addNavItem("/schedule", "计划");
  Esp32BaseWeb::addNavItem("/records", "记录");
  Esp32BaseWeb::addNavItem("/base-info", "基础信息");
  Esp32BaseWeb::addNavItem("/diagnostics", "诊断");
  Esp32BaseWeb::addPage("/index", "喂食器首页", FarmFeederApp::sendHomePage);
  Esp32BaseWeb::addPage("/schedule", "喂食计划", FarmFeederApp::sendSchedulePage);
  Esp32BaseWeb::addPage("/records", "喂食记录", FarmFeederApp::sendRecordsPage);
  Esp32BaseWeb::addPage("/base-info", "基础信息", FarmFeederApp::sendBaseInfoPage);
  Esp32BaseWeb::addPage("/diagnostics", "喂食器诊断", FarmFeederApp::sendDiagnosticsPage);
  if (!Esp32BaseWeb::addRoute("/schedule/edit", Esp32BaseWeb::METHOD_GET, FarmFeederApp::sendScheduleEditPage)) {
    ESP32BASE_LOG_E("farmfeeder", "page_route_register_failed path=/schedule/edit");
  }
  if (!Esp32BaseWeb::addRoute("/base-info/edit", Esp32BaseWeb::METHOD_GET, FarmFeederApp::sendBaseInfoEditPage)) {
    ESP32BASE_LOG_E("farmfeeder", "page_route_register_failed path=/base-info/edit");
  }
  addFarmFeederApi("/api/app/status", FarmFeederApp::sendStatusJson);
  addFarmFeederApi("/api/app/diagnostics", FarmFeederApp::sendDiagnosticsJson);
  addFarmFeederApi("/api/app/events/recent", FarmFeederApp::sendRecentEventsJson);
  addFarmFeederApi("/api/app/feeders/manual-start", FarmFeederApp::handleFeederManualStart);
  addFarmFeederApi("/api/app/feeders/start", FarmFeederApp::handleFeederStart);
  addFarmFeederApi("/api/app/feeders/stop", FarmFeederApp::handleFeederStop);
  addFarmFeederApi("/api/app/feeders/stop-all", FarmFeederApp::handleFeederStopAll);
  addFarmFeederApi("/api/app/feeders/targets", FarmFeederApp::sendTargetsJson);
  addFarmFeederApi("/api/app/feeders/target", FarmFeederApp::handleFeederTarget);
  addFarmFeederApi("/api/app/schedules", FarmFeederApp::sendSchedulesJson);
  addFarmFeederApi("/api/app/schedules/create", FarmFeederApp::handleScheduleCreate);
  addFarmFeederApi("/api/app/schedules/update", FarmFeederApp::handleScheduleUpdate);
  addFarmFeederApi("/api/app/schedules/delete", FarmFeederApp::handleScheduleDelete);
  addFarmFeederApi("/api/app/schedule-occurrence/skip", FarmFeederApp::handleScheduleSkip);
  addFarmFeederApi("/api/app/schedule-occurrence/cancel-skip", FarmFeederApp::handleScheduleCancelSkip);
  addFarmFeederApi("/api/app/buckets", FarmFeederApp::sendBucketsJson);
  addFarmFeederApi("/api/app/buckets/set-remaining", FarmFeederApp::handleBucketSetRemaining);
  addFarmFeederApi("/api/app/buckets/add-feed", FarmFeederApp::handleBucketAddFeed);
  addFarmFeederApi("/api/app/buckets/mark-full", FarmFeederApp::handleBucketMarkFull);
  addFarmFeederApi("/api/app/base-info", FarmFeederApp::sendBaseInfoJson);
  addFarmFeederApi("/api/app/base-info/channel", FarmFeederApp::handleBaseInfoChannel);
  addFarmFeederApi("/api/app/records", FarmFeederApp::sendRecordsJson);
  addFarmFeederApi("/api/app/maintenance/clear-today", FarmFeederApp::handleMaintenanceClearToday);
  addFarmFeederApi("/api/app/maintenance/clear-fault", FarmFeederApp::handleMaintenanceClearFault);
#endif
}

void FarmFeederApp::sendHomePage() {
#if ESP32BASE_ENABLE_WEB
  const FeederSnapshot snapshot = g_feeder.snapshot();
  const FeederBucketSnapshot buckets = g_buckets.snapshot();
  char runningMaskValue[16];
  char enabledMaskValue[16];
  char faultMaskValue[16];
  formatUint8(runningMaskValue, sizeof(runningMaskValue), snapshot.runningChannelMask);
  formatUint8(enabledMaskValue, sizeof(enabledMaskValue), snapshot.enabledChannelMask);
  formatUint8(faultMaskValue, sizeof(faultMaskValue), snapshot.faultChannelMask);

  Esp32BaseWeb::sendHeader("喂食器首页");
  Esp32BaseWeb::sendPageTitle("喂食器首页", "三路喂食状态、手工喂食和料桶维护");

  Esp32BaseWeb::beginPanel("喂食状态");
  Esp32BaseWeb::beginMetricGrid();
  Esp32BaseWeb::sendMetric("设备状态", deviceStateName(snapshot.state), g_feederMotorOutputEnabled ? "电机输出已启用" : "电机输出未启用");
  Esp32BaseWeb::sendMetric("运行通道掩码", runningMaskValue, "bit mask");
  Esp32BaseWeb::sendMetric("启用通道掩码", enabledMaskValue, faultMaskValue);
  Esp32BaseWeb::endMetricGrid();
  if (!g_feederMotorOutputEnabled) {
    Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                             "电机输出未启用",
                             "喂食命令会被保护拒绝；请在 Esp32Base App Config 中启用。");
  }
  Esp32BaseWeb::endPanel();

  Esp32BaseWeb::beginPanel("手工喂食");
  Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO,
                           "目标可留空",
                           "勾选要手工喂食的通道；目标留空时使用已保存默认目标。");
  Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/app/feeders/manual-start' onsubmit='return once(this)'>");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const uint8_t channelNumber = static_cast<uint8_t>(i + 1);
    const FeederChannelBaseInfo& info = buckets.channels[i].baseInfo;
    Esp32BaseWeb::sendChunk("<fieldset><legend>");
    Esp32BaseWeb::writeHtmlEscaped(info.name);
    Esp32BaseWeb::sendChunk("</legend><label><input type='checkbox' name='ch");
    sendUint8(channelNumber);
    Esp32BaseWeb::sendChunk("Enabled' value='1'");
    if (!info.enabled) {
      Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk("> 参与本次手工喂食</label><label>目标模式 <select name='ch");
    sendUint8(channelNumber);
    Esp32BaseWeb::sendChunk("Mode'><option value=''>使用默认目标</option><option value='grams'>按克数</option><option value='revolutions'>按圈数</option></select></label><label>克数 <input name='ch");
    sendUint8(channelNumber);
    Esp32BaseWeb::sendChunk("Grams' placeholder='例如 70'></label><label>圈数 <input name='ch");
    sendUint8(channelNumber);
    Esp32BaseWeb::sendChunk("Revolutions' placeholder='例如 1.5'></label></fieldset>");
  }
  Esp32BaseWeb::sendChunk("<div class='actions'><input type='submit' value='开始手工喂食'></div></form>");
  Esp32BaseWeb::sendInfoRowCompactForm("停止全部",
                                       "停止所有正在运行的喂食通道",
                                       nullptr,
                                       "/api/app/feeders/stop-all",
                                       "停止全部",
                                       nullptr,
                                       nullptr,
                                       Esp32BaseWeb::UI_DANGER);
  Esp32BaseWeb::endPanel();

  Esp32BaseWeb::beginPanel("料桶余量");
  Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><tr><th>通道</th><th>当前估算</th><th>满桶容量</th><th>维护</th></tr>");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const FeederBucketState& channel = buckets.channels[i];
    Esp32BaseWeb::sendChunk("<tr><td>");
    Esp32BaseWeb::writeHtmlEscaped(channel.baseInfo.name);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendFixedX100(channel.remainGramsX100);
    Esp32BaseWeb::sendChunk(" g</td><td>");
    sendFixedX100(channel.baseInfo.capacityGramsX100);
    Esp32BaseWeb::sendChunk(" g</td><td><form method='post' action='/api/app/buckets/set-remaining'><input type='hidden' name='channel' value='");
    sendUint8(i);
    Esp32BaseWeb::sendChunk("'><input name='remainGrams' placeholder='当前克数'><button>设置余量</button></form>");
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/buckets/add-feed'><input type='hidden' name='channel' value='");
    sendUint8(i);
    Esp32BaseWeb::sendChunk("'><input name='addedGrams' placeholder='加料克数'><button>记录加料</button></form>");
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/buckets/mark-full'><input type='hidden' name='channel' value='");
    sendUint8(i);
    Esp32BaseWeb::sendChunk("'><button>标记已满</button></form></td></tr>");
  }
  Esp32BaseWeb::sendChunk("</table></div>");
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

