tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
void FarmFeederApp::sendSchedulePage() {
#if ESP32BASE_ENABLE_WEB
  const FeederScheduleSnapshot schedules = g_schedules.snapshot();
  const FeederBucketSnapshot buckets = g_buckets.snapshot();
  uint32_t tomorrowDate = 0;
  feederNextServiceDate(schedules.serviceDate, tomorrowDate);
  Esp32BaseWeb::sendHeader("计划");
  Esp32BaseWeb::sendPageTitle("计划", "今日、明日执行实例和长期计划蓝本");
  sendOccurrenceTable(schedules, buckets, schedules.serviceDate, "今日计划");
  sendOccurrenceTable(schedules, buckets, tomorrowDate, "明日计划");
  Esp32BaseWeb::beginPanel("计划管理");
  Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO,
                           "长期蓝本",
                           "计划管理只维护每天固定执行规则；跳过只在今日或明日执行实例上操作。");
  Esp32BaseWeb::sendInfoRowCompactLink("新增计划", "创建新的长期喂食计划", nullptr, "/schedule/edit", "新增", Esp32BaseWeb::UI_OK);
  Esp32BaseWeb::sendInfoRowCompactLink("计划 JSON", "查看当前计划 API 输出", nullptr, "/api/app/schedules", "打开", Esp32BaseWeb::UI_INFO);
  Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><tr><th>ID</th><th>名称</th><th>时间</th><th>启用</th><th>目标</th><th>操作</th></tr>");
  for (uint8_t i = 0; i < schedules.planCount; ++i) {
    const FeederPlanState& plan = schedules.plans[i];
    Esp32BaseWeb::sendChunk("<tr><td>");
    sendUint8(plan.config.planId);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(plan.config.name);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendPlanTime(plan.config.timeMinutes);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::sendChunk(plan.config.enabled ? "是" : "否");
    Esp32BaseWeb::sendChunk("</td><td>");
    sendPlanTargetSummary(plan.config, buckets);
    Esp32BaseWeb::sendChunk("</td><td><a class='btnlink compact info' href='/schedule/edit?planId=");
    sendUint8(plan.config.planId);
    Esp32BaseWeb::sendChunk("'>编辑</a></td></tr>");
  }
  Esp32BaseWeb::sendChunk("</table></div>");
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmFeederApp::sendScheduleEditPage() {
#if ESP32BASE_ENABLE_WEB
  FeederPlanConfig config;
  bool editing = false;
  uint8_t planId = 0;
  if (Esp32BaseWeb::hasParam("planId")) {
    editing = readUint8Param("planId", planId) && findPlanConfig(planId, config);
    if (!editing) {
      Esp32BaseWeb::sendHeader("编辑计划");
      Esp32BaseWeb::sendPageTitle("编辑计划", "修改长期喂食计划");
      Esp32BaseWeb::beginPanel("计划不存在");
      Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                               "参数无效",
                               "指定计划不存在或参数无效。");
      Esp32BaseWeb::sendInfoRowCompactLink("返回计划", "回到计划列表", nullptr, "/schedule", "返回", Esp32BaseWeb::UI_INFO);
      Esp32BaseWeb::endPanel();
      Esp32BaseWeb::sendFooter();
      return;
    }
  } else {
    config.timeConfigured = true;
    config.timeMinutes = 8 * 60;
    config.channelMask = 0;
  }

  Esp32BaseWeb::sendHeader(editing ? "编辑计划" : "新增计划");
  Esp32BaseWeb::sendPageTitle(editing ? "编辑计划" : "新增计划",
                              "维护每天固定执行的计划蓝本");
  Esp32BaseWeb::beginPanel(editing ? "计划参数" : "新增计划参数");
  Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO,
                           "执行实例单独维护",
                           "跳过某次执行请回到计划页操作今日或明日实例。");
  Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='");
  Esp32BaseWeb::sendChunk(editing ? "/api/app/schedules/update" : "/api/app/schedules/create");
  Esp32BaseWeb::sendChunk("'>");
  if (editing) {
    Esp32BaseWeb::sendChunk("<input type='hidden' name='planId' value='");
    sendUint8(planId);
    Esp32BaseWeb::sendChunk("'>");
  }
  Esp32BaseWeb::sendChunk("<div class='fieldgrid'><div class='field med'><label>计划名称</label><input name='name' maxlength='");
  sendUint8(kFeederPlanNameMaxBytes);
  Esp32BaseWeb::sendChunk("' value='");
  Esp32BaseWeb::writeHtmlEscaped(config.name);
  Esp32BaseWeb::sendChunk("'></div><div class='field short'><label>启用</label><select name='enabled'><option value='1'");
  if (config.enabled) {
    Esp32BaseWeb::sendChunk(" selected");
  }
  Esp32BaseWeb::sendChunk(">启用</option><option value='0'");
  if (!config.enabled) {
    Esp32BaseWeb::sendChunk(" selected");
  }
  Esp32BaseWeb::sendChunk(">停用</option></select></div><div class='field med'><label>执行时间（当天分钟 0-1439）</label><input name='timeMinutes' value='");
  if (config.timeConfigured) {
    sendUint32(config.timeMinutes);
  }
  Esp32BaseWeb::sendChunk("'></div><div class='field med'><label>参与通道掩码</label><input name='channelMask' value='");
  sendUint8(config.channelMask);
  Esp32BaseWeb::sendChunk("'></div></div>");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    sendPlanTargetInputs(config, i);
  }
  Esp32BaseWeb::sendChunk("<div class='actions'><input type='submit' value='");
  Esp32BaseWeb::sendChunk(editing ? "保存计划" : "创建计划");
  Esp32BaseWeb::sendChunk("'> <a class='btnlink secondary' href='/schedule'>返回计划</a></div></form>");
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmFeederApp::sendRecordsPage() {
#if ESP32BASE_ENABLE_WEB
  Esp32BaseWeb::sendHeader("喂食记录");
  Esp32BaseWeb::sendPageTitle("记录", "查询喂食业务记录");

  Esp32BaseWeb::beginPanel("业务记录查询");
  Esp32BaseWeb::sendChunk("<form class='editform' method='get' action='/api/app/records'>");
  Esp32BaseWeb::sendChunk("<div class='fieldgrid'>");
  Esp32BaseWeb::sendChunk("<div class='field short'><label for='rec-start'>开始序号</label><input id='rec-start' name='start' type='number' min='0' value='0'></div>");
  Esp32BaseWeb::sendChunk("<div class='field short'><label for='rec-limit'>每页</label><input id='rec-limit' name='limit' type='number' min='1' max='16' value='16'></div>");
  Esp32BaseWeb::sendChunk("<div class='field short'><label for='rec-archive'>归档</label><input id='rec-archive' name='archive' type='number' min='0' max='16' value='0'><small>0 为当前文件，1-16 为轮转归档。</small></div>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label for='rec-start-time'>开始时间戳</label><input id='rec-start-time' name='startUnixTime' type='number' min='0'></div>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label for='rec-end-time'>结束时间戳</label><input id='rec-end-time' name='endUnixTime' type='number' min='0'></div>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label for='rec-type'>事件类型</label><input id='rec-type' name='eventType' placeholder='FeederManualRequested'></div>");
  Esp32BaseWeb::sendChunk("</div><div class='actions'><input type='submit' value='查询 JSON'></div></form>");
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmFeederApp::sendBaseInfoPage() {
#if ESP32BASE_ENABLE_WEB
  const FeederBucketSnapshot buckets = g_buckets.snapshot();
  Esp32BaseWeb::sendHeader("基础信息");
  Esp32BaseWeb::sendPageTitle("基础信息", "三路喂食通道名称、校准参数和容量");

