tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
  Esp32BaseWeb::beginPanel("通道基础信息");
  Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'>");
  Esp32BaseWeb::sendChunk("<tr><th>通道</th><th>名称</th><th>启用</th><th>每圈信号数</th><th>每圈克数</th><th>满桶容量</th><th>操作</th></tr>");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const FeederBucketState& channel = buckets.channels[i];
    Esp32BaseWeb::sendChunk("<tr><td>");
    sendUint8(static_cast<uint8_t>(i + 1));
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(channel.baseInfo.name);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::sendChunk(channel.baseInfo.enabled ? "是" : "否");
    Esp32BaseWeb::sendChunk("</td><td>");
    sendInt32(channel.baseInfo.outputPulsesPerRev);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendFixedX100(channel.baseInfo.gramsPerRevX100);
    Esp32BaseWeb::sendChunk(" g</td><td>");
    sendFixedX100(channel.baseInfo.capacityGramsX100);
    Esp32BaseWeb::sendChunk(" g</td><td><a class='btnlink compact info' href='/base-info/edit?channel=");
    sendUint8(i);
    Esp32BaseWeb::sendChunk("'>编辑</a></td></tr>");
  }
  Esp32BaseWeb::sendChunk("</table></div>");
  Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO,
                           "运行数据不在本页维护",
                           "当前余量属于运行维护数据，在首页“料桶余量”中维护；本页只管理通道基础信息。");
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmFeederApp::sendBaseInfoEditPage() {
#if ESP32BASE_ENABLE_WEB
  uint8_t channel = 0;
  if (!readUint8Param("channel", channel) || !validAppChannel(channel)) {
    Esp32BaseWeb::sendHeader("编辑通道");
    Esp32BaseWeb::sendPageTitle("编辑通道", "维护通道基础信息");
    Esp32BaseWeb::beginPanel("通道不存在");
    Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                             "参数无效",
                             "指定通道不存在或参数无效。");
    Esp32BaseWeb::sendInfoRowCompactLink("返回基础信息", "回到通道列表", nullptr, "/base-info", "返回", Esp32BaseWeb::UI_INFO);
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
    return;
  }

  const FeederBucketSnapshot buckets = g_buckets.snapshot();
  const FeederBucketState& info = buckets.channels[channel];
  Esp32BaseWeb::sendHeader("编辑通道");
  Esp32BaseWeb::sendPageTitle("编辑通道", "维护通道基础信息");
  Esp32BaseWeb::beginPanel(info.baseInfo.name);
  Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                           "会影响后续估算",
                           "修改会影响后续手工喂食、计划投喂和料桶余量估算。运行中不能保存。");
  Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/app/base-info/channel' onsubmit='return once(this)'>");
  Esp32BaseWeb::sendChunk("<input type='hidden' name='channel' value='");
  sendUint8(channel);
  Esp32BaseWeb::sendChunk("'>");
  Esp32BaseWeb::sendChunk("<div class='fieldgrid'><div class='field med'><label>名称</label><input name='name' maxlength='");
  sendUint8(kFeederChannelNameMaxBytes);
  Esp32BaseWeb::sendChunk("' value='");
  Esp32BaseWeb::writeHtmlEscaped(info.baseInfo.name);
  Esp32BaseWeb::sendChunk("'></div>");
  Esp32BaseWeb::sendChunk("<div class='field short'><label>启用</label><select name='enabled'><option value='1'");
  if (info.baseInfo.enabled) {
    Esp32BaseWeb::sendChunk(" selected");
  }
  Esp32BaseWeb::sendChunk(">启用</option><option value='0'");
  if (!info.baseInfo.enabled) {
    Esp32BaseWeb::sendChunk(" selected");
  }
  Esp32BaseWeb::sendChunk(">停用</option></select></div>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label>每圈信号数</label><input name='outputPulsesPerRev' value='");
  sendInt32(info.baseInfo.outputPulsesPerRev);
  Esp32BaseWeb::sendChunk("'></div>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label>每圈克数</label><input name='gramsPerRev' value='");
  sendFixedX100(info.baseInfo.gramsPerRevX100);
  Esp32BaseWeb::sendChunk("'></div>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label>满桶容量（克）</label><input name='capacityGrams' value='");
  sendFixedX100(info.baseInfo.capacityGramsX100);
  Esp32BaseWeb::sendChunk("'></div>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label>确认 token</label><input name='confirmToken'></div>");
  Esp32BaseWeb::sendChunk("<div class='field short'><label>确认</label><select name='confirm'><option value='true'>确认</option><option value='false'>只申请 token</option></select></div></div>");
  Esp32BaseWeb::sendChunk("<div class='actions'><input class='warn' type='submit' value='保存通道'> <a class='btnlink secondary' href='/base-info'>返回基础信息</a></div></form>");
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmFeederApp::sendDiagnosticsPage() {
#if ESP32BASE_ENABLE_WEB
  const FeederSnapshot snapshot = g_feeder.snapshot();
  char installedMaskValue[16];
  char runningMaskValue[16];
  char faultMaskValue[16];
  char motorReadyValue[16];
  formatUint8(installedMaskValue, sizeof(installedMaskValue), snapshot.installedChannelMask);
  formatUint8(runningMaskValue, sizeof(runningMaskValue), snapshot.runningChannelMask);
  formatUint8(faultMaskValue, sizeof(faultMaskValue), snapshot.faultChannelMask);
  formatUint8(motorReadyValue, sizeof(motorReadyValue), g_feederMotorReadyMask);

  Esp32BaseWeb::sendHeader("喂食器诊断");
  Esp32BaseWeb::sendPageTitle("诊断", "只读状态接口和维护动作");

  Esp32BaseWeb::beginPanel("业务诊断");
  Esp32BaseWeb::beginMetricGrid();
  Esp32BaseWeb::sendMetric("安装通道掩码", installedMaskValue, "bit mask");
  Esp32BaseWeb::sendMetric("运行通道掩码", runningMaskValue, "bit mask");
  Esp32BaseWeb::sendMetric("故障通道掩码", faultMaskValue, motorReadyValue);
  Esp32BaseWeb::endMetricGrid();
  Esp32BaseWeb::sendInfoRowCompactLink("诊断 JSON", "控制器、计划、料桶和电机状态", nullptr, "/api/app/diagnostics", "打开", Esp32BaseWeb::UI_INFO);
  Esp32BaseWeb::sendInfoRowCompactLink("状态 JSON", "喂食器运行状态摘要", nullptr, "/api/app/status", "打开", Esp32BaseWeb::UI_INFO);
  Esp32BaseWeb::endPanel();

  Esp32BaseWeb::beginPanel("维护动作");
  Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                           "需要二次确认",
                           "首次提交会返回确认 token；确认后带 confirm=true 和 token 再提交。");
  Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/app/maintenance/clear-today' onsubmit='return once(this)'>");
  Esp32BaseWeb::sendChunk("<div class='fieldgrid'>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label>确认 token</label><input name='confirmToken'></div>");
  Esp32BaseWeb::sendChunk("<div class='field short'><label>确认</label><select name='confirm'><option value='true'>确认</option><option value='false'>只申请 token</option></select></div>");
  Esp32BaseWeb::sendChunk("</div><div class='actions'><input class='danger' type='submit' value='清空今日执行状态'></div></form>");
  Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/app/maintenance/clear-fault' onsubmit='return once(this)'>");
  Esp32BaseWeb::sendChunk("<div class='fieldgrid'>");
  Esp32BaseWeb::sendChunk("<div class='field short'><label>通道掩码</label><input name='channelMask' value='7'></div>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label>确认 token</label><input name='confirmToken'></div>");
  Esp32BaseWeb::sendChunk("<div class='field short'><label>确认</label><select name='confirm'><option value='true'>确认</option><option value='false'>只申请 token</option></select></div>");
  Esp32BaseWeb::sendChunk("</div><div class='actions'><input class='danger' type='submit' value='清除通道故障'></div></form>");
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmFeederApp::sendStatusJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const FeederSnapshot snapshot = g_feeder.snapshot();
  const FeederRunSnapshot runSnapshot = g_runs.snapshot();
  const FeederScheduleSnapshot scheduleSnapshot = g_schedules.snapshot();
  const FeederBucketSnapshot bucketSnapshot = g_buckets.snapshot();

  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"appKind\":\"FarmFeeder\",");
  Esp32BaseWeb::sendChunk("\"firmware\":\"");
  Esp32BaseWeb::writeJsonEscaped(Esp32Base::firmwareVersion());
  Esp32BaseWeb::sendChunk("\",\"schemaVersion\":1,");
  Esp32BaseWeb::sendChunk("\"state\":\"");
  Esp32BaseWeb::sendChunk(deviceStateName(snapshot.state));
  Esp32BaseWeb::sendChunk("\",\"installedChannelMask\":");
  sendUint8(snapshot.installedChannelMask);
  Esp32BaseWeb::sendChunk(",\"enabledChannelMask\":");
  sendUint8(snapshot.enabledChannelMask);
  Esp32BaseWeb::sendChunk(",\"runningChannelMask\":");
  sendUint8(snapshot.runningChannelMask);
  Esp32BaseWeb::sendChunk(",\"faultChannelMask\":");
  sendUint8(snapshot.faultChannelMask);
  Esp32BaseWeb::sendChunk(",\"runningCount\":");
  sendUint8(snapshot.runningCount);
  Esp32BaseWeb::sendChunk(",\"channels\":");
  sendChannelArray(snapshot, runSnapshot);
  Esp32BaseWeb::sendChunk(",\"schedule\":");
  sendScheduleSummary(scheduleSnapshot);
  Esp32BaseWeb::sendChunk(",\"bucketSummary\":");
  sendBucketAggregate(bucketSnapshot);
  Esp32BaseWeb::sendChunk(",\"today\":");
  sendTodaySummary(g_today.snapshot());
  Esp32BaseWeb::sendChunk(",\"recentCommand\":");
  sendRecentCommandJson();
  Esp32BaseWeb::sendChunk(",");
  sendFeederMotorOutputJson();
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

