tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
void FarmFeederApp::sendDiagnosticsJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const FeederSnapshot snapshot = g_feeder.snapshot();
  const FeederScheduleSnapshot scheduleSnapshot = g_schedules.snapshot();
  const FeederBucketSnapshot bucketSnapshot = g_buckets.snapshot();
  const FeederRecordSnapshot recordSnapshot = g_records.snapshot();

  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"appKind\":\"FarmFeeder\",\"mode\":\"readOnlyDiagnostics\"");
  Esp32BaseWeb::sendChunk(",\"state\":\"");
  Esp32BaseWeb::sendChunk(deviceStateName(snapshot.state));
  Esp32BaseWeb::sendChunk("\",\"installedChannelMask\":");
  sendUint8(snapshot.installedChannelMask);
  Esp32BaseWeb::sendChunk(",\"enabledChannelMask\":");
  sendUint8(snapshot.enabledChannelMask);
  Esp32BaseWeb::sendChunk(",\"runningChannelMask\":");
  sendUint8(snapshot.runningChannelMask);
  Esp32BaseWeb::sendChunk(",\"faultChannelMask\":");
  sendUint8(snapshot.faultChannelMask);
  Esp32BaseWeb::sendChunk(",\"schedule\":");
  sendScheduleSummary(scheduleSnapshot);
  Esp32BaseWeb::sendChunk(",\"bucketSummary\":");
  sendBucketAggregate(bucketSnapshot);
  Esp32BaseWeb::sendChunk(",\"records\":{\"recentCount\":");
  sendUint8(recordSnapshot.count);
  Esp32BaseWeb::sendChunk(",\"recentCapacity\":");
  sendUint8(kFeederRecentRecordCapacity);
  Esp32BaseWeb::sendChunk(",\"flashReady\":");
#if ESP32BASE_ENABLE_FS
  Esp32BaseWeb::sendChunk(Esp32BaseFs::isReady() ? "true" : "false");
#else
  Esp32BaseWeb::sendChunk("false");
#endif
  Esp32BaseWeb::sendChunk("},\"currentSensors\":{\"installed\":false},");
  Esp32BaseWeb::sendChunk("\"at24c\":{\"storeReady\":");
  Esp32BaseWeb::sendChunk(g_at24cStoreReady ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"online\":");
  Esp32BaseWeb::sendChunk(i2cDeviceOnline(0x50) ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"address\":\"0x50\"},");
  sendFeederMotorOutputJson();
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

void FarmFeederApp::sendRecentEventsJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint32_t limitParam = 32;
  uint32_t offsetParam = 0;
  if (!readUint32ParamOptional("limit", limitParam) ||
      !readUint32ParamOptional("start", offsetParam) ||
      limitParam == 0 || limitParam > 100 || offsetParam > UINT16_MAX) {
    beginRawJson(400);
    Esp32BaseWeb::sendChunk("{\"ok\":false,\"error\":\"InvalidArgument\"}");
    endRawJson();
    return;
  }
  BusinessEventJsonState state;
  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"store\":\"app_events\",\"ready\":");
  Esp32BaseWeb::sendChunk(FarmAutoEventLog::isReady() ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"faulted\":");
  Esp32BaseWeb::sendChunk(FarmAutoEventLog::faulted() ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"count\":");
  sendUint32(FarmAutoEventLog::count());
  Esp32BaseWeb::sendChunk(",\"capacity\":");
  sendUint32(FarmAutoEventLog::capacity());
  Esp32BaseWeb::sendChunk(",\"events\":[");
  const bool readOk = FarmAutoEventLog::readLatest(static_cast<uint16_t>(offsetParam),
                                                   static_cast<uint16_t>(limitParam),
                                                   sendBusinessEventJsonCallback,
                                                   &state);
  Esp32BaseWeb::sendChunk("],\"readOk\":");
  Esp32BaseWeb::sendChunk(readOk ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"returned\":");
  sendUint32(state.emitted);
  Esp32BaseWeb::sendChunk(",\"lastError\":\"");
  Esp32BaseWeb::writeJsonEscaped(FarmAutoEventLog::lastError());
  Esp32BaseWeb::sendChunk("\"}");
  endRawJson();
#endif
}

void FarmFeederApp::sendSchedulesJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  beginRawJson(200);
  sendScheduleSummary(g_schedules.snapshot());
  endRawJson();
#endif
}

void FarmFeederApp::sendBucketsJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"channels\":");
  sendBucketSummary(g_buckets.snapshot());
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

void FarmFeederApp::sendBaseInfoJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"channels\":");
  sendBaseInfoSummary(g_buckets.snapshot());
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

void FarmFeederApp::sendTargetsJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"channels\":");
  sendTargetSummary(g_targets.snapshot(), g_buckets.snapshot());
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

void FarmFeederApp::sendRecordsJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  FeederRecordQuery query;
  uint32_t limitParam = query.limit;
  if (!readUint32ParamOptional("start", query.startIndex) ||
      !readUint32ParamOptional("limit", limitParam) ||
      !readUint32ParamOptional("startUnixTime", query.startUnixTime) ||
      !readUint32ParamOptional("endUnixTime", query.endUnixTime) || limitParam == 0 ||
      limitParam > kFeederRecordPageMaxRecords) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  query.limit = static_cast<uint8_t>(limitParam);
  char eventType[32];
  if (Esp32BaseWeb::getParam("eventType", eventType, sizeof(eventType)) && eventType[0] != '\0') {
    if (!recordTypeFromName(eventType, query.type)) {
      sendResultJson(400, "InvalidArgument");
      return;
    }
    query.typeFilterEnabled = true;
  }
  uint32_t archiveIndex = 0;
  if (!readUint32ParamOptional("archive", archiveIndex) || archiveIndex > kFeederRecordMaxArchives) {
    sendResultJson(400, "InvalidArgument");
    return;
  }

  beginRawJson(200);
#if ESP32BASE_ENABLE_FS
  char recordPath[96];
  if (!feederRecordPathForArchive(archiveIndex, recordPath, sizeof(recordPath))) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  FeederRecordPage page;
  const FeederRecordReadResult readResult = readFeederRecordPage(recordPath,
                                                                 query,
                                                                 feederRecordFileSize,
                                                                 readFeederRecordBytesAt,
                                                                 nullptr,
                                                                 page);
  if (readResult == FeederRecordReadResult::Ok && page.totalRecords > 0) {
    Esp32BaseWeb::sendChunk("{\"source\":\"flash\",\"start\":");
    sendUint32(page.startIndex);
    Esp32BaseWeb::sendChunk(",\"archive\":");
    sendUint32(archiveIndex);
    Esp32BaseWeb::sendChunk(",\"nextIndex\":");
    sendUint32(page.nextIndex);
    Esp32BaseWeb::sendChunk(",\"limit\":");
    sendUint32(limitParam);
    Esp32BaseWeb::sendChunk(",\"count\":");
    sendUint8(page.count);
    Esp32BaseWeb::sendChunk(",\"totalRecords\":");
    sendUint32(page.totalRecords);
    Esp32BaseWeb::sendChunk(",\"recordBytes\":");
    sendUint32(kFeederRecordEncodedMaxBytes);
    Esp32BaseWeb::sendChunk(",\"records\":");
    sendRecordArray(page);
    Esp32BaseWeb::sendChunk("}");
    endRawJson();
    return;
  }
  if (archiveIndex > 0) {
    Esp32BaseWeb::sendChunk("{\"source\":\"flash\",\"start\":0,\"archive\":");
    sendUint32(archiveIndex);
    Esp32BaseWeb::sendChunk(",\"nextIndex\":0,\"limit\":");
    sendUint32(limitParam);
    Esp32BaseWeb::sendChunk(",\"count\":0,\"totalRecords\":0,\"recordBytes\":");
    sendUint32(kFeederRecordEncodedMaxBytes);
    Esp32BaseWeb::sendChunk(",\"records\":[]}");
    endRawJson();
    return;
  }
#endif

  const FeederRecordSnapshot snapshot = g_records.snapshot();
  Esp32BaseWeb::sendChunk("{\"source\":\"ram\",\"start\":0,\"limit\":");
  sendUint32(kFeederRecentRecordCapacity);
  Esp32BaseWeb::sendChunk(",\"count\":");
  sendUint8(snapshot.count);
  Esp32BaseWeb::sendChunk(",\"totalRecords\":");
  sendUint8(snapshot.count);
  Esp32BaseWeb::sendChunk(",\"capacity\":");
  sendUint8(kFeederRecentRecordCapacity);
  Esp32BaseWeb::sendChunk(",\"records\":");
  sendRecordArray(snapshot);
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

