tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
void FarmFeederApp::handleFeederTarget() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t channel = 0;
  FeederTargetRequest request;
  if (!readUint8Param("channel", channel) || !validAppChannel(channel) ||
      !readTargetModeParam("targetMode", request.mode) ||
      !readInt32ParamOptional("targetGramsX100", request.targetGramsX100) ||
      !readInt32ParamOptional("targetRevolutionsX100", request.targetRevolutionsX100)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  const FeederTargetResult result = g_targets.setTarget(channel, request);
  if (result == FeederTargetResult::Ok) {
    persistFeederTargetsIfReady();
  }
  sendResultJson(result == FeederTargetResult::Ok ? 200 : 400,
                 result == FeederTargetResult::Ok ? "Ok" : "InvalidArgument");
#endif
}

void FarmFeederApp::handleFeederManualStart() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t channelMask = 0;
  if (!readManualChannelMask(channelMask) || channelMask == 0 ||
      (channelMask & static_cast<uint8_t>(~configuredChannelMask())) != 0) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  FeederTargetSnapshot targetOverrides;
  if (!readManualTargetOverrides(channelMask, targetOverrides)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  FeederTargetBatch targets;
  const uint32_t commandId = allocateCommandId();
  const FeederStartResult result =
      startResolvedTargets(channelMask, FeederRunSource::Manual, commandId, targets, &targetOverrides);
  FeederRecord record;
  record.commandId = commandId;
  record.type = FeederRecordType::ManualRequested;
  record.result = feederRecordResultFromCommand(result.result);
  record.requestedMask = channelMask;
  record.successMask = result.successMask;
  record.busyMask = result.busyMask;
  record.faultMask = result.faultMask;
  record.skippedMask = result.skippedMask;
  recordBusinessEvent(record);
  sendStartResultJson(result, &targets, commandId);
#endif
}

void FarmFeederApp::handleFeederStart() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t channelMask = 0;
  if (!readUint8Param("channelMask", channelMask)) {
    uint8_t channel = 0;
    if (!readUint8Param("channel", channel) || !validAppChannel(channel)) {
      sendResultJson(400, "InvalidArgument");
      return;
    }
    channelMask = static_cast<uint8_t>(1U << channel);
  } else if ((channelMask & static_cast<uint8_t>(~configuredChannelMask())) != 0) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  FeederTargetBatch targets;
  const uint32_t commandId = allocateCommandId();
  const FeederStartResult result =
      startResolvedTargets(channelMask, FeederRunSource::Manual, commandId, targets);
  FeederRecord record;
  record.commandId = commandId;
  record.type = FeederRecordType::ManualRequested;
  record.result = feederRecordResultFromCommand(result.result);
  record.requestedMask = channelMask;
  record.successMask = result.successMask;
  record.busyMask = result.busyMask;
  record.faultMask = result.faultMask;
  record.skippedMask = result.skippedMask;
  recordBusinessEvent(record);
  sendStartResultJson(result, &targets, commandId);
#endif
}

void FarmFeederApp::handleFeederStop() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t channelMask = 0;
  if (!readUint8Param("channelMask", channelMask)) {
    uint8_t channel = 0;
    if (!readUint8Param("channel", channel) || !validAppChannel(channel)) {
      sendResultJson(400, "InvalidArgument");
      return;
    }
    channelMask = static_cast<uint8_t>(1U << channel);
  } else if ((channelMask & static_cast<uint8_t>(~configuredChannelMask())) != 0) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  const uint32_t commandId = allocateCommandId();
  requestFeederMotorStop(channelMask);
  const FeederCommandResult result = g_feeder.stopChannels(channelMask);
  if (result == FeederCommandResult::Ok) {
    settleStoppedRuns(channelMask);
  }
  FeederRecord record;
  record.commandId = commandId;
  record.type = FeederRecordType::ChannelStopped;
  record.result = feederRecordResultFromCommand(result);
  record.requestedMask = channelMask;
  record.successMask = result == FeederCommandResult::Ok ? channelMask : 0;
  recordBusinessEvent(record);
  sendResultJson(result == FeederCommandResult::Ok ? 200 : 400,
                 feederCommandResultName(result),
                 commandId);
#endif
}

void FarmFeederApp::handleFeederStopAll() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const uint8_t runningMask = g_feeder.snapshot().runningChannelMask;
  const uint32_t commandId = allocateCommandId();
  requestFeederMotorStop(runningMask);
  const FeederCommandResult result = g_feeder.stopAll();
  if (result == FeederCommandResult::Ok) {
    settleStoppedRuns(runningMask);
  }
  FeederRecord record;
  record.commandId = commandId;
  record.type = FeederRecordType::ChannelStopped;
  record.result = feederRecordResultFromCommand(result);
  record.requestedMask = runningMask;
  record.successMask = result == FeederCommandResult::Ok ? runningMask : 0;
  recordBusinessEvent(record);
  sendResultJson(result == FeederCommandResult::Ok ? 200 : 400,
                 feederCommandResultName(result),
                 commandId);
#endif
}

void FarmFeederApp::handleMaintenanceClearToday() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const FeederSnapshot snapshot = g_feeder.snapshot();
  if (snapshot.runningChannelMask != 0) {
    sendResultJson(409, "Busy");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "today:%lu",
           static_cast<unsigned long>(g_schedules.snapshot().serviceDate));
  if (!requireConfirm("clear-today", resource)) {
    return;
  }

  const uint32_t commandId = allocateCommandId();
  g_schedules.clearToday();
  g_today.beginDay(g_schedules.snapshot().serviceDate);
  persistFeederScheduleIfReady();
  persistFeederTodayIfReady();

