tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
void FarmFeederApp::handleBucketAddFeed() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t channel = 0;
  int32_t addedGramsX100 = 0;
  if (!readUint8Param("channel", channel) || !validAppChannel(channel) ||
      !readFixedX100ParamOptional("addedGrams", "addedGramsX100", addedGramsX100)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "bucket:%u", static_cast<unsigned>(channel));
  if (!requireConfirm("add-feed", resource)) {
    return;
  }
  const int32_t oldRemain = g_buckets.snapshot().channels[channel].remainGramsX100;
  const FeederBucketResult result = g_buckets.addFeed(channel, addedGramsX100, 0);
  if (result == FeederBucketResult::Ok) {
    persistFeederBucketsIfReady();
    const int32_t newRemain = g_buckets.snapshot().channels[channel].remainGramsX100;
    FarmAutoEventLog::recordFeederBucketRefilled(channel, oldRemain, newRemain);
  }
  sendResultJson(result == FeederBucketResult::Ok ? 200 : 400, bucketResultName(result));
#endif
}

void FarmFeederApp::handleBucketMarkFull() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t channel = 0;
  if (!readUint8Param("channel", channel) || !validAppChannel(channel)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "bucket:%u", static_cast<unsigned>(channel));
  if (!requireConfirm("mark-full", resource)) {
    return;
  }
  const int32_t oldRemain = g_buckets.snapshot().channels[channel].remainGramsX100;
  const FeederBucketResult result = g_buckets.markFull(channel, 0);
  if (result == FeederBucketResult::Ok) {
    persistFeederBucketsIfReady();
    const int32_t newRemain = g_buckets.snapshot().channels[channel].remainGramsX100;
    FarmAutoEventLog::recordFeederBucketRefilled(channel, oldRemain, newRemain);
  }
  sendResultJson(result == FeederBucketResult::Ok ? 200 : 400, bucketResultName(result));
#endif
}

void FarmFeederApp::handleBaseInfoChannel() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t channel = 0;
  bool enabled = false;
  int32_t outputPulsesPerRev = 0;
  int32_t gramsPerRevX100 = 0;
  int32_t capacityGramsX100 = 0;
  if (!readUint8Param("channel", channel) || !validAppChannel(channel) ||
      !readBoolParam("enabled", enabled) ||
      !readInt32Param("outputPulsesPerRev", outputPulsesPerRev) ||
      !readFixedX100ParamOptional("gramsPerRev", "gramsPerRevX100", gramsPerRevX100) ||
      !readFixedX100ParamOptional("capacityGrams", "capacityGramsX100", capacityGramsX100)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  if (g_feeder.snapshot().runningChannelMask != 0) {
    sendResultJson(400, "Busy");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "base-info:%u", static_cast<unsigned>(channel));
  if (!requireConfirm("base-info", resource)) {
    return;
  }

  FeederChannelBaseInfo info;
  info = g_buckets.snapshot().channels[channel].baseInfo;
  readChannelNameParam(info);
  info.enabled = enabled;
  info.outputPulsesPerRev = outputPulsesPerRev;
  info.gramsPerRevX100 = gramsPerRevX100;
  info.capacityGramsX100 = capacityGramsX100;
  const FeederBucketResult result = g_buckets.updateBaseInfo(channel, info);
  if (result == FeederBucketResult::Ok) {
    syncFeederConfigFromBaseInfo();
    persistFeederCalibrationIfReady();
    persistFeederBucketsIfReady();
    FarmAutoEventLog::recordFeederBaseInfoChanged(channel);
  }
  sendResultJson(result == FeederBucketResult::Ok ? 200 : 400, bucketResultName(result));
#endif
}
